redis_test_for_auto_numa_problem/redis_test_result_L_ON_2nd/memtier_benchmark_L_ON_2nd_Random110_P3_20230621002715.log
20        Threads
5         Connections per thread
900       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        97158.22          ---          ---        29.93203        28.03100        48.38300        68.60700    206935.61 
Gets         9715.74      9715.74         0.00        29.96691        28.03100        48.63900        68.60700     20645.95 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     106873.96      9715.74         0.00        29.93520        28.03100        48.38300        68.60700    227581.57 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       3.375        0.000
SET      23.679        5.000
SET      24.319       10.000
SET      24.831       15.000
SET      25.215       20.000
SET      25.727       25.000
SET      26.623       30.000
SET      27.007       35.000
SET      27.391       40.000
SET      27.647       45.000
SET      28.031       50.000
SET      28.287       52.500
SET      28.543       55.000
SET      28.927       57.500
SET      29.311       60.000
SET      29.695       62.500
SET      30.207       65.000
SET      30.847       67.500
SET      31.359       70.000
SET      31.999       72.500
SET      32.639       75.000
SET      33.279       76.250
SET      33.535       77.500
SET      34.047       78.750
SET      34.303       80.000
SET      34.815       81.250
SET      35.071       82.500
SET      35.583       83.750
SET      36.095       85.000
SET      36.607       86.250
SET      37.119       87.500
SET      37.631       88.125
SET      37.887       88.750
SET      38.143       89.375
SET      38.399       90.000
SET      38.911       90.625
SET      39.423       91.250
SET      39.679       91.875
SET      40.191       92.500
SET      40.447       93.125
SET      40.959       93.750
SET      41.215       94.062
SET      41.215       94.375
SET      41.471       94.688
SET      41.727       95.000
SET      41.983       95.312
SET      42.239       95.625
SET      42.495       95.938
SET      43.007       96.250
SET      43.263       96.562
SET      43.519       96.875
SET      43.775       97.031
SET      44.031       97.188
SET      44.287       97.344
SET      44.543       97.500
SET      44.543       97.656
SET      44.799       97.812
SET      45.055       97.969
SET      45.311       98.125
SET      45.823       98.281
SET      46.079       98.438
SET      46.335       98.516
SET      46.591       98.594
SET      46.847       98.672
SET      47.103       98.750
SET      47.615       98.828
SET      47.871       98.906
SET      48.383       98.984
SET      48.639       99.062
SET      49.151       99.141
SET      49.663       99.219
SET      50.175       99.258
SET      50.431       99.297
SET      50.943       99.336
SET      51.455       99.375
SET      51.967       99.414
SET      52.479       99.453
SET      53.247       99.492
SET      54.271       99.531
SET      55.295       99.570
SET      56.319       99.609
SET      56.831       99.629
SET      57.599       99.648
SET      58.367       99.668
SET      59.647       99.688
SET      60.415       99.707
SET      61.183       99.727
SET      61.951       99.746
SET      62.719       99.766
SET      63.231       99.785
SET      63.999       99.805
SET      64.511       99.814
SET      65.023       99.824
SET      65.535       99.834
SET      66.047       99.844
SET      66.559       99.854
SET      67.071       99.863
SET      67.583       99.873
SET      68.095       99.883
SET      68.607       99.893
SET      69.119       99.902
SET      69.631       99.907
SET      70.143       99.912
SET      70.143       99.917
SET      70.655       99.922
SET      71.167       99.927
SET      71.679       99.932
SET      72.703       99.937
SET      73.215       99.941
SET      74.239       99.946
SET      76.287       99.951
SET      77.311       99.954
SET      78.335       99.956
SET      81.407       99.958
SET     201.727       99.961
SET     226.303       99.963
SET     236.543       99.966
SET     241.663       99.968
SET     249.855       99.971
SET     251.903       99.973
SET     257.023       99.976
SET     258.047       99.977
SET     261.119       99.978
SET     264.191       99.979
SET     266.239       99.980
SET     266.239       99.982
SET     266.239       99.983
SET     268.287       99.984
SET     272.383       99.985
SET     274.431       99.987
SET     276.479       99.988
SET     278.527       99.988
SET     278.527       99.989
SET     278.527       99.990
SET     278.527       99.990
SET     278.527       99.991
SET     280.575       99.991
SET     282.623       99.992
SET     284.671       99.993
SET     284.671       99.993
SET     288.767       99.994
SET     288.767       99.994
SET     288.767       99.995
SET     288.767       99.995
SET     292.863       99.995
SET     292.863       99.995
SET     292.863       99.996
SET     301.055       99.996
SET     301.055       99.996
SET     301.055       99.997
SET     835.583       99.997
SET     835.583       99.997
SET     835.583       99.997
[...]
SET     835.583       99.998
SET     835.583       99.998
SET     835.583       99.998
[...]
SET     835.583       99.999
SET     835.583       99.999
SET     835.583       99.999
[...]
SET     835.583      100.000
SET     835.583      100.000
SET     835.583      100.000
[...]
SET     843.775      100.000
SET     843.775      100.000
---
GET       5.855        0.000
GET      23.679        5.000
GET      24.319       10.000
GET      24.831       15.000
GET      25.215       20.000
GET      25.727       25.000
GET      26.623       30.000
GET      27.007       35.000
GET      27.391       40.000
GET      27.647       45.000
GET      28.031       50.000
GET      28.287       52.500
GET      28.543       55.000
GET      28.927       57.500
GET      29.311       60.000
GET      29.695       62.500
GET      30.207       65.000
GET      30.847       67.500
GET      31.359       70.000
GET      31.999       72.500
GET      32.767       75.000
GET      33.279       76.250
GET      33.791       77.500
GET      34.047       78.750
GET      34.559       80.000
GET      34.815       81.250
GET      35.071       82.500
GET      35.583       83.750
GET      36.095       85.000
GET      36.607       86.250
GET      37.375       87.500
GET      37.631       88.125
GET      37.887       88.750
GET      38.143       89.375
GET      38.655       90.000
GET      38.911       90.625
GET      39.423       91.250
GET      39.679       91.875
GET      40.191       92.500
GET      40.447       93.125
GET      40.959       93.750
GET      41.215       94.062
GET      41.471       94.375
GET      41.727       94.688
GET      41.983       95.000
GET      42.239       95.312
GET      42.495       95.625
GET      42.751       95.938
GET      43.007       96.250
GET      43.263       96.562
GET      43.775       96.875
GET      43.775       97.031
GET      44.031       97.188
GET      44.287       97.344
GET      44.543       97.500
GET      44.799       97.656
GET      45.055       97.812
GET      45.311       97.969
GET      45.567       98.125
GET      45.823       98.281
GET      46.335       98.438
GET      46.591       98.516
GET      46.847       98.594
GET      47.103       98.672
GET      47.359       98.750
GET      47.871       98.828
GET      48.127       98.906
GET      48.383       98.984
GET      48.895       99.062
GET      49.407       99.141
GET      49.919       99.219
GET      50.175       99.258
GET      50.687       99.297
GET      51.199       99.336
GET      51.455       99.375
GET      52.223       99.414
GET      52.735       99.453
GET      53.759       99.492
GET      54.527       99.531
GET      55.551       99.570
GET      56.319       99.609
GET      57.087       99.629
GET      57.855       99.648
GET      58.623       99.668
GET      59.647       99.688
GET      60.415       99.707
GET      61.183       99.727
GET      62.207       99.746
GET      62.719       99.766
GET      63.487       99.785
GET      63.999       99.805
GET      64.767       99.814
GET      65.023       99.824
GET      65.535       99.834
GET      66.047       99.844
GET      66.559       99.854
GET      67.071       99.863
GET      67.583       99.873
GET      68.095       99.883
GET      68.607       99.893
GET      69.119       99.902
GET      69.631       99.907
GET      70.143       99.912
GET      70.143       99.917
GET      70.655       99.922
GET      71.167       99.927
GET      71.679       99.932
GET      72.703       99.937
GET      73.727       99.941
GET      74.751       99.946
GET      76.287       99.951
GET      77.823       99.954
GET      80.383       99.956
GET      83.455       99.958
GET     214.015       99.961
GET     235.519       99.963
GET     236.543       99.966
GET     241.663       99.968
GET     250.879       99.971
GET     251.903       99.973
GET     257.023       99.976
GET     261.119       99.977
GET     264.191       99.978
GET     264.191       99.979
GET     266.239       99.980
GET     266.239       99.982
GET     266.239       99.983
GET     268.287       99.984
GET     272.383       99.985
GET     274.431       99.987
GET     276.479       99.988
GET     278.527       99.988
GET     278.527       99.989
GET     278.527       99.990
GET     278.527       99.990
GET     278.527       99.991
GET     280.575       99.991
GET     282.623       99.992
GET     282.623       99.993
GET     284.671       99.993
GET     286.719       99.994
GET     288.767       99.994
GET     288.767       99.995
GET     288.767       99.995
GET     292.863       99.995
GET     292.863       99.995
GET     301.055       99.996
GET     301.055       99.996
GET     301.055       99.996
GET     827.391       99.997
GET     835.583       99.997
GET     835.583      100.000
---
WAIT      0.000      100.000